Tekla Open API Reference for Tekla Structures 2025
ModelHistory.TakeModifications Method
Overload List
Name | Description
TakeModifications(String, ModificationStamp)
Take modifications since previous call.
TakeModifications(String, IEnumerable<ModelObject.ModelObjectEnum>, ModificationStamp)
Take modifications since previous call, with object type filtering.
Top
See Also
Reference
ModelHistory Class
Tekla.Structures.Model.History Namespace